module.exports = {
	DEBUG: 1,
	CACHE: {
		list: '_DS_NKD_L',
		code: '_DS_NKD_C',
	},
	CONFIG:{

		buffs: [{
				id: 1,name: '疗愈',good: 1,
				desc: '每回合恢复生命力',
			},{
				id: 2,name: '抵挡',good: 1,
				desc: '每回合恢复防御力',
			},{
				id: 3,name: '强攻',good: 1,
				desc: '攻击力增加',
			},{
				id: 4,name: '专注',good: 1,
				desc: '权重增加',
			},{
				id: 5,name: '反伤',good: 1,
				desc: '对伤害来源造成伤害',
			},{
				id: 6,name: '削弱',good: 1,
				desc: '造成伤害后减少对方的防御力',
			},{
				id: 7,name: '清算',good: 1,
				desc: '造成伤害后减少对方的权重',
			},{
				id: 8,name: '淘金',good: 1,
				desc: '造成伤害后能获得金币',
			},{
				id: 9,name: '嗜血',good: 1,
				desc: '造成伤害后恢复自己的生命力',
			},{
				id: 10,name: '架势',good: 1,
				desc: '造成伤害后恢复自己的防御力',
			},{
				id: 11,name: '屏息',good: 1,
				desc: '体力消耗减少',
			},{
				id: 101,name: '中毒',good: 0,
				desc: '每回合损失生命力',
			},{
				id: 102,name: '破绽',good: 0,
				desc: '受到的伤害增加',
			},{
				id: 103,name: '软弱',good: 0,
				desc: '攻击力下降',
			},{
				id: 104,name: '涣散',good: 0,
				desc: '权重下降',
			},{
				id: 105,name: '失衡',good: 0,
				desc: '每回合损失防御力',
			},{
				id: 106,name: '厄运',good: 0,
				desc: '受到的其它负面状态不会消褪',
			},{
				id: 107,name: '出血',good: 0,
				desc: '进行攻击会损失生命',
			},{
				id: 108,name: '动摇',good: 0,
				desc: '无法提升防御力',
			},{
				id: 109,name: '内伤',good: 0,
				desc: '无法恢复生命力',
			},{
				id: 110,name: '疲劳',good: 0,
				desc: '体力消耗增加',
			},{
				id: 111,name: '无力',good: 0,
				desc: '无法提升攻击力',
			},],
    }
}
/*

game = {
	money: 1000,
	crystal: 0,
	day: 1,
	hour: 0,
	meTeamIDs: [1,2,4,9,], // 队伍角色ID
}

buff = {

}

skill = {
	id: 11,
	level: 1,
	name: '治愈术',
	effects: [3,7,], // 技能效果数组
	【
	1:单体攻击|2:全体攻击|
	3:我方单体添加状态|4敌方单体添加状态|5:消除我方单体状态|6:消除敌方单体状态
	7:恢复单体生命|8:恢复全体生命|
	9:提升自我护甲|10:提升自我权重|11:提升自我治愈|12:提升自我力量|13:提升自我防御|
	14:降低单体护甲|15:降低单体权重|16:降低单体治愈|17:降低单体力量|18:降低单体防御|
	19:降低全体护甲|20:降低全体权重|21:降低全体治愈|22:降低全体力量|23:降低全体防御|
	】
	buffIds: [1,2,], // 添加的状态ID数组
	buffLevels: [1,1,], // 添加的状态等级数组
	consume: 6, // 体力消耗
	desc: '', // 描述
}

equip = {
	id: 11,
	level: 1,
	type: 1, // [1:身体|2:手|3:配饰]
	attrs: [[0,3],[2,1],[4,1],], // 装备属性 [[属性下标,属性调整值]]
}

role = {
	id: 1,

	name: '赵日天',
	gender: 1,
	age: 18,
	level: 1,
	exp: 0,
	stylies: [15,28,77,4,14,], // 人格 [勇猛,敏感,野心,理智,道德]
	teamSeq: 1, // 主角队伍中的顺位，由小到大【0：不在主角队伍中】

	attrs: [5,1,2,3, 0,0,0, 3,50,4], // 十维身体属性 [0生命力,1攻击力,2护甲,3权重, 4治愈（回血）,5力量（增攻）,6防御（增甲）, 7气力,8精力（总气力）,9智力]

	equipIds: [11,22,0,], // 装备ID数组 [身体，手，装饰]

	skillIds: [1,] // 技能ID数组

	battleTempData: { // 战斗中的状态
		hp: 5, // 生命力
		atk: 1, // 攻击力
		def: 2, // 护甲
		maxDef: 2, // 最大护甲
		weight: 3, // 权重
		heal: 0, // 治愈
		str: 0, // 力量
		dex: 0, // 防御
		vig: 3, // 气力
		tvig: 50, // 精力（总体力）
		int: 8, // 智力
		buffs: [{ // 状态栏
			id: 1,
			name: '急救',
			desc: '每回合恢复生命力',
			level: 1,
			trendVals: [20,0,0,0], // 倾向分值[保护,强化,伤害,弱化]
			elapse: 9, // 剩余回合数
		},]
		mentalDef: 150, // 心理防御
		move: 1, // 本回合行动者顺序，由小到大【0:非本回合行动者】
		alive: 1, // 存活
		isPlayer: 1, // 玩家可操控
	},

}

*/

/*
effects: [{ // 额外效果列表
	trigType: 1, // 触发类型 【1:战斗开始|2:公共回合开始|3:自己回合开始|4:发动攻击|5:受到攻击|6:发动治疗|7:生命力提升】
	targets: [3,], // 作用目标ID列表
	eventType: 1, // 事件类型 【1：属性调整|2：金币调整|3：添加状态|4：消除状态】
	event:
},]
*/
