module.exports = {
	DEBUG: 0,
	CACHE: {
		list: '_DS_MONO_L',
		code: '_DS_MONO_C',
		tip1: '_DS_MONO_TP1',
		tip2: '_DS_MONO_TP2',
		tip3: '_DS_MONO_TP3',
		not_show_guide: '_DS_MONO_NSG',
	},
	CONFIG:{
        init:{
            money: 5000, // 初始资金
            image: 100, // 初始形象值
			humanResourcePoint: 2000, // 初始人力资源点数
			roomResourcePoint: 0, // 初始房间资源点数
			roomType: 0, // 初始房间类型
			roomBasicImage: 10, // 初始房间基础形象
			randomOtherMoney: [10000,40000], // 其他公司初始资金随机范围
			randomOtherImage: [500,3000], // 其他公司初始形象随机范围
			roomPower: 1000, // 第一个房间的初始电力
			roomDurab: 0, // 第一个房间的初始耐久
			roomRisk: 2, // 第一个房间的初始风险等级
			roomAuto: 0, // 第一个房间的初始自动化程度
			roomLevel: 1, // 第一个房间的初始等级
			randomOtherRoomRange: [3,5], // 其他公司初始房间数量随机范围
			randmOtherRoomPowerRange: [50,10000], // 其他公司初始房间电力随机范围
			randmOtherRoomDurabRange: [0,7000], // 其他公司初始房间耐久随机范围
			randmOtherRoomRiskRange: [2,2], // 其他公司初始房间风险等级随机范围
			randmOtherRoomAutoRange: [0,10000], // 其他公司初始房间自动化随机范围
			randmOtherRoomLevelRange: [1,3], // 其他公司初始房间等级随机范围
			terminalDurab: 0, // 终端机初始耐久
			terminalPowerLevel: 1, // 终端机初始供电等级
			terminalDigLevel: 1, // 终端机初始挖矿等级
			terminalTradeLevel: 1, // 终端机初始交易等级
        },
        namespace: { // 名字空间
            common: ['热','马','湖','金','大','美','腾','万','奇','育','小','福','田','新','宇','通','长','尚','仁','德','成','恒','亚','雅','卓','星','宝','牛','飞','西','龙','合','世','界','曲','文','花','华','庆','丰','中','北','南','东','苏','资','耀','光','雷','民','银','宜','日','维','林','生','电','联','古','宫','鸿','宏','吉','基','蓝','百','顺','多','利','立','力','丽','特','矿','春','法','京','紫','井','汇','河','山','江','泽','科','柯','邦','意','奥','晨','知','达','英','阳','洋','喜','飞','三','五','八','九','洲','申','谷','内','渚','尔','太','空','全','托','思','速','道','艾','嘉','索','天','风','云','贵','米','明','网','讯','狗','昆','财','富','复','莱','能','语','射','重','辉','惠','慧','韩','涵','唐','堂','老','岚','漫','泉','加','它','安','鲁','香','凡','秋','夏','渡','千','朝','乐','贤','如','雪','学','上','本','秀','汉','菲','普','瑞','悦','钢','铁','荣','一','康','加','佳','领','尼','格','杰','洛','凡','艺','燕','国','果','简','建','宁','巨','菊','聚','章','城','雄','登','图','途','昂','海','黑','和','知','直','深','鱼','舒','露','真','众','想','初','车','保','晓','门','心','鼎','定','丁','宾','体','永','旺','平','品','朋','岛','友','优','麦','崇','围','伟','卫','松','孙','角','莎','梦','皇','环','欧','典','卡','酷','展','强','媒','甲','怡','外'],
            factory: ['集团','集团','集团','集团','集团','控股','控股','控股','控股','控股','控股','股份','产业','重工','科技','传媒','文化','能源','贸易','工厂'],
            room: ['街','街','街','街','街','街','街','街','街','街','街','街','街','街','街','路','路','路','路','路','路','路','路','路','路','路','路','路','路','路','路','区','区','区','区','区','区','区','区','区','区','区','区','区','区','区','区','镇','镇','镇','镇','桥','桥','桥','桥','桥','坡','塘','屯','坟','冲','园','院','铺','庄','山','津','湾','地','城','村','署','台','广场','广场','广场','广场','广场','广场','公园','公园','公园','公园','公园','公园','大道','大学','公寓','大厦','商区','工区','小区'],
            worker1: ['赵','赵','赵','赵','赵','赵','赵','赵','赵','赵','赵','钱','钱','钱','钱','钱','孙','孙','孙','孙','孙','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','吴','吴','吴','吴','吴','吴','郑','郑','郑','郑','郑','郑','郑','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','冯','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','方','方','方','范','范','范','范','范','褚','卫','蒋','蒋','蒋','蒋','蒋','沈','沈','沈','沈','沈','沈','沈','韩','韩','韩','韩','韩','韩','韩','韩','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','朱','朱','朱','朱','朱','朱','秦','秦','秦','秦','秦','尤','许','许','许','许','许','许','许','何','何','何','何','何','吕','吕','吕','吕','吕','施','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','孔','孔','孔','曹','曹','曹','曹','曹','严','华','金','金','金','魏','魏','陶','陶','姜','姜','戚','谢','谢','谢','邹','喻','柏','水','窦','章','云','苏','潘','潘','潘','潘','葛','奚','彭','彭','彭','彭','彭','郎','鲁','韦','昌','马','马','马','马','马','马','马','苗','苗','凤','花','方','俞','任','任','任','任','袁','袁','袁','袁','袁','柳','鲍','史','唐','唐','唐','唐','唐','唐','唐','唐','唐','唐','唐','费','廉','岑','薛','薛','薛','雷','贺','贺','贺','贺','贺','倪','汤','滕','殷','罗','罗','罗','罗','罗','罗','毕','郝','邬','安','常','乐','于','时','傅','皮','卞','齐','康','伍','余','元','顾','顾','顾','顾','孟','平','黄','黄','黄','黄','黄','黄','和','穆','萧','尹','姚','姚','姚','姚','姚','姚','邵','湛','汪','汪','汪','汪','祁','毛','毛','毛','毛','毛','禹','狄','米','贝','明','计','伏','成','戴','戴','戴','戴','戴','戴','谈','宋','宋','宋','宋','宋','宋','宋','宋','宋','茅','庞','庞','庞','熊','纪','舒','舒','舒','舒','屈','项','祝','董','董','董','董','董','梁','梁','梁','梁','杜','杜','杜','杜','杜','阮','蓝','闵','席','季','麻','强','贾','路','娄','危','江','江','江','江','江','江','江','江','江','江','江','童','童','童','颜','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','梅','盛','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','刁','钟','徐','徐','徐','徐','徐','徐','徐','徐','邱','邱','骆','高','高','夏','夏','夏','夏','夏','夏','夏','蔡','蔡','蔡','蔡','蔡','蔡','田','樊','胡','胡','胡','胡','胡','胡','胡','凌','霍','虞','万','支','柯','管','卢','莫','莫','莫','莫','经','房','裘','缪','干','解','应','宗','丁','宣','邓','邓','邓','邓','邓','邓','郁','单','杭','洪','包','诸','左','石','崔','吉','龚','程','邢','滑','裴','陆','陆','陆','陆','陆','陆','陆','陆','陆','荣','翁','荀','羊','於','惠','甄','曲','家','封','芮','羿','储','靳','汲','糜','松','井','段','富','巫','乌','焦','巴','弓','牧','山','谷','车','侯','蓬','全','班','仰','秋','仲','伊','宫','宁','仇','暴','甘','厉','戎','祖','武','符','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','景','詹','束','龙','龙','龙','叶','幸','司','韶','黎','薄','印','宿','白','怀','蒲','从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙','池','乔','阴','能','苍','双','闻','莘','党','翟','谭','贡','劳','逄','姬','申','扶','堵','冉','宰','郦','雍','卻','桑','桂','濮','牛','寿','通','边','燕','冀','浦','尚','农','温','别','庄','晏','柴','瞿','阎','充','慕','连','茹','习','宦','艾','鱼','容','向','古','易','易','易','易','易','易','易','慎','戈','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','庾','终','居','衡','步','都','耿','满','弘','匡','国','文','寇','广','禄','东','欧','沃','利','越','隆','哈','欧阳','欧阳','欧阳','欧阳','欧阳','欧阳','上官','慕容','司马','皇甫','东方','夏侯','公孙','司徒','轩辕','令狐','漆雕','淳于','宇文',],
            worker2: ["良","嘉","懿","翟","雪","枫","洋","以","雨","竹","关","烨","姜","叶","帆","玄","冰","菱","隽","颖","中","瑞","羿","名","郸","华","歌","闵","意","景","晨","风","占","丹","云","招","优","扬","如","昌","小","师","位","寒","向","南","豆","孟","桂","德","明","李","吉","月","尹","思","九","恬","蒿","煜","都","岚","方","访","冬","光","盼","欧","勤","羊","清","韦","宁","酒","昕","海","詹","文","晋","觅","仇","余","陶","维","路","晶","辉","贸","听","祢","吹","郝","念","潮","祺","褚","迎","简","安","居","觉","濮","和","顺","洛","虹","旋","桑","高","爽","皮","乐","法","琼","贵","衍","鲍","语","雁","孙","天","纵","璧","郁","绍","焦","书","双","硕","水","折","怀","田","达","系","又","凌","凡","蒲","乾","艳","京","逸","致","滨","买","泽","飞","淡","希","白","夏","季","元","绿","乘","澄","邈","鸿","字","昔","女","端","献","仪","苗","史","筠","丙","烟","求","俞","野","谌","平","虞","营","恨","董","痴","春","黄","巧","沙","考","计","问","玉","闭","紫","丝","韶","熙","马","远","慕","漆","雕","谭","蚁","邢","燕","修","永","沃","班","今","支","珊","兆","超","竺","鹿","千","储","肇","康","针","赖","智","佘","任","友","堵","心","鞠","贺","那","焱","柳","喜","悦","宜","独","仆","局","之","桃","回","茂","卢","板","羽","化","祈","欣","笑","理","赫","连","诚","舒","澈","孔","吕","前","曜","淳","于","亥","褒","楠","尾","第","檀","星","晓","奉","涵","映","易","其","半","多","蒋","荷","冷","倚","廖","太","合","锺","英","允","潭","操","冠","扶","夕","深","用","善","波","诸","侯","才","司","答","代","西","红","旭","丑","朱","晖","委","纳","仁","溪","巢","全","厍","仵","轩","辕","秘","喻","家","晏","旅","亦","老","咏","市","卿","党","穆","容","接","霍","秀","休","范","张","礼","尔","费","丰","为","梁","丘","原","越","环","苏","离","瑜","镜","畅","但","可","佳","金","乌","图","桐","朗","涂","然","单","塞","藤","谬","束","鄂","庄","卑","石","毕","逄","闻","人","幻","侍","蒙","朝","赤","幼","楼","亘","时","莹","何","空","墨","从","霜","福","行","沐","央","让","信","咸","谏","植","裔","暮","悠","苦","呼","延","艺","商","生","长","琴","兴","勾","辰","沛","迟","弥","隐","牟","不","瓮","牧","乔","唱","保","枝","荣","潜","禽","典","暄","布","初","惜","赛","成","徐","彭","湃","边","经","好","融","毛","姓","律","别","斯","学","林","左","新","萨","梓","侨","奥","曲","车","佼","岑","含","岳","万","相","伯","尤","栋","古","馥","吴","实","频","子","皎","靖","世","通","恩","井","萧","庚","河","漫","邓","泉","冉","润","潘","侬","止","言","建","寻","狄","载","朋","尚","丁","检","江","奇","迈","蓬","若","道","辜","盘","乙","钞","彦","游","东","杜","改","伊","洲","巫","禾","斋","歆","程","台","勋","滢","锐","琦","拜","阿","贾","曾","震","顿","亢","银","施","裕","熊","謇","祝","会","捷","籍","席","影","崇","黎","闽","令","艾","树","仲","驰","完","颜","笛","汲","圭","彩","民","召","倩","夷","真","孤","琰","习","仰","帛","藩","贝","邱","随","韩","严","六","吟","普","醉","势","栗","逢","谯","所","斐","粟","槐","官","铁","澜","谢","危","曹","犁","温","舌","君","贤","说","钦","告","斌","慎","次","铭","鱼","况","来","许","唐","养","晗","谈","廉","流","於","盛","桓","磬","繁","义","骆","画","始","薄","宋","楚","戴","及","罗","奈","须","蓝","速","羲","同","举","宿","解","祥","塔","展","爵","辛","木","杭","洪","利","青","航","权","伦","吾","音","暖","丛","邹","庆","浮","莫","望","陆","在","竭","袁","蔡","津","鲜","齐","牵","钟","源","仍","宫","申","米","却","进","陈","泣","胡","跃","悟","上","伏","肖","睿","衣","螺","昭","麻","牢","饶","阔","宣","撒","仙","知","终","阴","堂","印","微","贰","留","禄","戈","函","过","芒","浦","首","税","性","杉","郑","荤","宾","湛","续","帖","年","寸","益","棠","房","稽","朴","格","剑","冒","葛","铃","锦","拉","悉","五","殷","步","管","闪","满","伍","沈","拱","度","幸","夜","壬","练","池","珠","傅","立","冀","樊","湘","查","线","桥","祭","迪","尉","后","归","凭","姚","冶","校","卷","广","辟","由","错","衷","项","聂","雍","粘","章","包","果","漠","称","璞","段","北","睦","应","纶","胜","开","揭","雷","滑","偶","薛","茅","冯","自","菁","干","常","己","能","珂","集","寿","疏","锁","出","务","柴","厉","是","秦","绪","圣","纪","藉","汗","鸾","充","阚","顾","崔","介","脱","巴","机","谊","杨","佛","魁","守","诺","苍","三","七","久","数","或","获","角","未","克","群","药","宝","童","先","备","处","喜","空","米","瞬","索","迷","家","早","玩","阵","湖","命","尘","难","哭","往","无","晚","围","网","弯","请","缺","去","钱","起","气","轻","热","忍","认","染","儒","他","也","贪","右","页","亚","育","赢","要","一","与","因","约","异","鸥","怕","骗","普","飘","案","暗","事","杀","四","声","输","神","算","色","术","伤","酸","送","私","审","岁","售","视","得","当","毒","懂","等","灯","动","呆","敌","赌","非","烦","分","负","肺","反","否","富","复","罚","该","鬼","功","互","还","黑","花","很","灰","户","候","欢","悔",],
			worker3: ["大","犹","有","裘","渊","勇","皓","庞","羿","皇","甫","肥","辉","少","松","基","业","剧","寄","卫","公","甘","定","杰","森","谷","山","寇","坚","隆","本","宰","敖","龙","雄","贯","昂","伟","傲","阳","叔","坤","运","汉","宗","卓","武","磨","正","志","翁","弘","俊","昆","鹏","狂","昊","朔","泰","柯","博","孝","刑","门","种","威","彬","旷","城","励","骑","军","瀚","荆","府","峻","宏","督","刚","毅","凯","腾","骏","刁","强","宇","郎","掌","士","喆","牛","夫","资","抗","豪","钊","虎","帅","厚","藏","衡","盖","镇","拓","磊","政","父","宦","僧","巨","力","将","屠","鲁","侠","玮","屈","御","泥","苟","愚","登","革","工","暴","耀","百","晟","龚","夹","喇","哲","直","洗","浩","国","岩","盾","冲","日","土","枪","欠","恶","肉","油","盐","派","岸","死","受","寿","升","刀","东","蛋","更","狗","敢","火","虎","恒",],
			worker4: ["娥","秋","莲","曼","凝","芷","蝶","姝","麴","凝","碧","灵","丽","娜","梅","豆","萱","晴","夙","梦","素","馨","妍","柔","彤","梦","妙","菡","曼","妮","蝶","凝","碧","灵","依","曼","莲","芷","贞","韵","露","静","雅","蕊","爱","夙","萱","妍","妮","雯","芳","鄢","琪","芮","美","花","芸","柏","瑰","瑶","倪","婉","蓉","香","霞","雅","姿","莞","骄","诗","蕊","苑","珍","蛾","采","焉","兰","慧","敏","淑","朵","怜","盈","儿","萦","怡","玥","菀","洁","芹","漪","娴","绮","婷","萍","蕾","芬","薇","凤","奕","翠","琳","莉","璇","蕙","蓓","汝","芙","芝","媛","芊","慈","嫣","茹","莎","婵","娟","姗","菲","惠","舞","茜","倩","娿","甜","穂","宛","忆","蝴",],
        },
		risk_name_map: ['保护','常规','高强'], // 风险类别名称
		job_name_map: ['-','发电','挖矿','交易','终端维护','自动化','房间维护','管理员','门面','人力搜索','房间搜索','形象总代言','外交','间谍','资源管理员',], // 职能类别名称
		room_type_name_map: ['通用房','发电站','挖矿厂','交易所'], // 房间类型名称
		randomRoomBasicImageProb: 100, // 其他公司初始房间拥有基础形象概率
        max_durab: 10000, // 最大老化值
        max_balance: 100, // 房间最大平衡值
        max_auto: 10000, // 房间最大自动化值
        min_basicImage: 20, // 房间最大基础门面
        max_basicImage: 120, // 房间最大基础门面
        max_room_level: 3, // 最大房间等级
        max_terminal_level: 3, // 最大终端等级
        terminal_count_distribution: [6,8,10], // 房间每级终端数量
        max_power_level: 3, // 终端最高供电等级
        max_dig_level: 3, // 终端最高挖矿等级
        max_trade_level: 3, // 终端最高交易等级
        room_levelup_cost: [20000,40000], // 房间升级费用
        power_levelup_cost: [3000,6000], // 供电等级升级费用
        dig_levelup_cost: [3000,6000], // 挖矿等级升级费用
        trade_levelup_cost: [3000,6000], // 交易等级升级费用
		sell_factor: .5, // 贩卖系数
		randmNewRoomDurabRange: [2000,3000], // 新生成房间老化化随机范围
		randmNewRoomAutoRange: [0,0], // 新生成房间自动化随机范围

		searchRoomPointCost: 1000, // 一个房间的搜索点数花费
		seachRoomPointAcc: 10, // 房间搜索花费累加值
		searchWorkerPointCost: 1000, // 一个人员的搜索点数花费
		seachWorkerPointAcc: 10, // 人员搜索花费累加值

		max_support: 10000, // 最大支持点数
		invest_support_threshold: 3000, // 投资支持率阈值
		steal_worker_support_threshold: 5000, // 偷取人员支持率阈值
		steal_worker_support_cost: 5000, // 偷取人员支持率消耗
		steal_room_support_threshold: 10000, // 偷取房间支持率阈值
		steal_room_support_cost: 10000, // 偷取房间支持率消耗
		buy_factory_support_threshold: 0, // 收购工厂支持率阈值
		image_price_factor: .2, // 形象/价值系数

		damage_money_cost: 700000, // 一次形象破坏资金消耗
		saction_money_cost: 1000000, // 经济打压最低投入金额

		max_image_prop_money: 10000, // 形象宣传投入资金最大值
		image_prop_factor: .001, // 形象宣传提升形象系数

		days_limit_range: [800,850,900,950,1000,1000], // 时间限制范围

		max_investment: 100000, // 最多投资金额

		terminal: {
			base: 1.5,
			power_factor: .3,
			durab_increase: 25,
			dig_factor: .3,
			dig_power_consume_base: 40,
			dig_power_consume_factor: 40,
			trade_money_factor: .25,
			trade_support_factor: .01,
			trade_power_consume_base: 40,
			trade_power_consume_factor: 40,
			durab_threshold: 5000,
			durab_factor: 1.8,
			durab_consume_factor: .8,
		},

		room: {
			base: 1.5,
			image_increse_base: 8,
			image_increse_factor: .3,
			durab_fix: 10,
			durab_factor: .75,
			durab_consume_factor: 2,
			auto_factor: 1.2,
			auto_power_consume: 0,
			auto_money_consume: 100,
			durab_threshold: 5000,
			durab_increase_factor: .2,
			durab_terminal_factor: .5,

			type_increase_factor: 1.3,
			type_normal_factor: 1,
			type_decrease_factor: .7,
		},

		factory: {
			image_increse_base: 10,
			image_increse_factor: .4,
			rrp_factor: .2,
			rrp_fix: 100,
			image_hrp_factor: 8,
			hrp_factor: .2,
			hrp_fix: 20,
		},

		relation: {
			support_decrease_fix: 250,
			support_increase_fix: 15,
			support_joint_increase_factor: .5,
			support_trade_increase_factor: .4,
			image_decrease_fix: 50,
			image_decrease_factor_range: [.2,.8,1,1.5,2,2.5,3],
			image_decrease_consume_fix: 1000,
			joint_image_threshold: 3000,
		},

        max_worker_ability: 100, // 人员最高能力值
		period: 10, // 市场清空周期
    }
}
/*
worker = {
	id: 1,
	tid: 1,
	rid: 1,
	age: 1,
	rname: '', // 房间名
	fid: 1,
	fname: '', // 工厂名
	tfid: 1, // 外部对接工厂ID
	tfname: '', // 外部对接工厂名
	name: '',
	str: 1,(1-100)
	int: 1,
	com: 1,
	img: 1,
	boss: true, // 是老板
	job: 0, // [0:待命|
				1:终端发电|2:终端挖矿|3:终端交易|4:终端维护|
				5:房间自动化|6:房间维护|7:房间管理|8:房间门面|
				9:人力搜索|10:房间搜索|11:形象总代言人|
				12:外交||13:卧底|14:资源管理员]
	studyfid: 1, // 深造所在工厂ID
	studyfname: '', // 深造所在工厂名
	group: 0, // 房间分组(0-4)
}

terminal = {
	id: 1,
	rid: 1,
	fid: 1,
	durab: 100,(1-10000)
	powerLevel: 1,(1-3)
	digLevel: 1,(1-3)
	tradeLevel: 1,(1-3)
	group: 0, // 房间分组(0-4)
}

room = {
	id: 1,
	fid: 1,
	fname: '', // 工厂名
	name: '',
	power: 0,
	order: 0, // 排序值
	type: 1, // 房间类型[0：通用间|1：发电站|2：挖矿厂|3：交易所]
	basicImage: 1,(0-120) // 基础形象
	durab: 1000,(1-10000)
	risk: 1,(1-3)
	auto: 1500,(1-10000)
	level: 1,(1-3)
	avgPower: 1,(0,1) // 接受平分电力
	assignPower: 1,(0,1) // 智能输出电力
	group: 0, // 房间分组[0：自管|1：代理|2：自营]
}

factory = {
	id: 1,
	name: '',
	money: 50,
	image: 15,
	hrp: 0, // 人力搜索点数
	rrp: 0, // 房间搜索点数
	damaged: false, // 当前回合已经接受过一次打压
}

relation = {
	from: 1,
	fromName: '',
	to: 2,
	toName: '',
	invest: 0, // 投资$
	support: 0, // 支持率(0-10000)
}

task = {
	id: 1,
	fid: 1,
	fname: '',
	desc: '',
	type: 1, // 完成类型 [1:形象|2:总资金|3:工人数量|4:支持率]
	day: 100,
	target: 1000,
	stat: 1, // 状态 [1:未完成|2:已完成|3:已失败]
	rewardType: 1, // 奖励类型 [1:形象|2:总资金|3:工人数量|4:支持率|5:]
	reward: 50000, // 奖励
}

























*/
