module.exports = {
	DEBUG: 1,
	CACHE: {
		sto: '_DS_RWD_L',
	},
	ASSETS: {
		image_urls:[
		    require('../assets/bg-battle.png'),
		    require('../assets/bg-battle-0.png'),
		    require('../assets/bg-battle-1.png'),
		    require('../assets/bg-battle-2.png'),
		    require('../assets/bg-battle-3.png'),
		    require('../assets/bg-battle-4.png'),
		    require('../assets/bg-battle-5.png'),
		    require('../assets/bg-battle-6.png'),
		    require('../assets/bg-battle-7.png'),
		    require('../assets/bg-battle-8.png'),
		    require('../assets/bg-battle-9.png'),
		    require('../assets/bg-town-1.png'),
		    require('../assets/bg-menu.png'),
		    require('../assets/icon-female-1.png'),
		    require('../assets/icon-female-2.png'),
		    require('../assets/icon-female-3.png'),
		    require('../assets/icon-female-4.png'),
		    require('../assets/icon-female-5.png'),
		    require('../assets/icon-female-6.png'),
		    require('../assets/icon-female-7.png'),
		    require('../assets/icon-male-1.png'),
		    require('../assets/icon-male-2.png'),
		    require('../assets/icon-male-3.png'),
		    require('../assets/icon-male-4.png'),
		    require('../assets/icon-male-5.png'),
		    require('../assets/icon-male-6.png'),
		    require('../assets/icon-male-7.png'),
		    require('../assets/outline-male.png'),
		    require('../assets/outline-female.png'),
		    require('../assets/banner-chain.png'),
		    require('../assets/bg-banner.png'),
		    require('../assets/banner-brand.png'),
		    require('../assets/bg-tarven.png'),
		    require('../assets/arrow-down.png'),
		    require('../assets/bg-roll.png'),
		    require('../assets/icon-beer.png'),
		    require('../assets/icon-bonfire.png'),
		    require('../assets/icon-brick-off.png'),
		    require('../assets/icon-brick-on.png'),
		    require('../assets/icon-core.png'),
		    require('../assets/icon-flag.png'),
		],
	},
	CONFIG:{
		initGameData: {
			day: 1,
			mapList: [], // 所有地图数据数组
			wantedList: [], // 悬赏榜
			x: 0, // 主角技能经验（0-10000）
			xl: 1, // 主角技能经验等级
			xp: 0, // 主角技能复制点数

			allUnits: [], // 角色
			unitIndex: 101, // 角色 ID 索引
			allEquips: [], // 装备
			equipIndex: 101, // 装备 ID 索引
			allSkills: [], // 技能
			skillIndex: 101, // 技能 ID 索引
		},
		attrMap: [`生命`,`精力`,`体力`,`防御`,`力量`,`精准`,`速度`,`智力`,`定力`,`隐蔽`,`爆发`,],

		goodBuffs: [{ // 倾向分值[1保护,2强化,3伤害,4弱化]
				id: 1,name: '止痛',trend:1,good:1,
				desc: '受到的治疗效果增强',
				construction: [1.6, 1.8, 2.0, 2.2, 2.4, 2.6, 2.8, 3.0, 3.2, ],
			},{
				id: 2,name: '护盾',trend:1,good:1,
				desc: '受到的攻击伤害减少',
				construction: [.75, .72, .69, .66, .63, .6, .57, .54, .51, ],
			},{
				id: 3,name: '祝福',trend:1,good:1,
				desc: '阻挡同级和低级的负面状态',
				construction: [0, 0, 0, 0, 0, 0, 0, 0, 0,],
			},{
				id: 4,name: '节流',trend:2,good:1,
				desc: '减少攻击和技能的体力消耗',
				construction: [.84, .8, .76, .72, .68, .64, .6, .56, .52,],
			},{
				id: 5,name: '养息',trend:2,good:1,
				desc: '回合结束时自动恢复体力',
				construction: [.1, .125, .15, .175, .2, .225, .25, .275, .3,],
			},{
				id: 6,name: '潜行',trend:1,good:1,
				desc: '主动行动不增加存在感',
				construction: [0,0,0,0,0,0,0,0,0,],
			},{
				id: 7,name: '财迷',trend:1,good:1,
				desc: '攻击命中后能获得金币',
				construction: [10, 15, 25, 50, 80, 125, 200, 300, 500,],
			},{
				id: 8,name: '架势',trend:1,good:1,
				desc: '受到伤害后立刻恢复防御力',
				construction: [.1, .125, .15, .175, .2, .225, .25, .275, .3,],
			},{
				id: 9,name: '通畅',trend:2,good:1,
				desc: '受到伤害后立刻恢复体力',
				construction: [.1, .125, .15, .175, .2, .225, .25, .275, .3,],
			},{
				id: 10,name: '狂暴',trend:2,good:1,
				desc: '无视压制，受到伤害后立刻提升行动力',
				construction: [1000, 1250, 1500, 1750, 2000, 2250, 2500, 2750, 3000,],
			},{
				id: 11,name: '反伤',trend:1,good:1,
				desc: '对伤害来源造成伤害',
				construction: [.2, .225, .25, 275, .3, .325, .35, .375, .4,],
			},{
				id: 12,name: '嗜血',trend:1,good:1,
				desc: '造成伤害后恢复自己的生命',
				construction: [.2, .225, .25, 275, .3, .325, .35, .375, .4,],
			},{
				id: 13,name: '猛攻',trend:2,good:1,
				desc: '提升力量补正',
				construction: [1.6, 1.8, 2, 2.2, 2.4, 2.6, 2.8, 3, 3.2,],
			},{
				id: 14,name: '鹰眼',trend:2,good:1,
				desc: '提升精准补正',
				construction: [1.6, 1.8, 2, 2.2, 2.4, 2.6, 2.8, 3, 3.2,],
			},{
				id: 15,name: '迅捷',trend:2,good:1,
				desc: '提升行动力增速',
				construction: [1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2, 2.1,],
			},{
				id: 16,name: '亢奋',trend:2,good:1,
				desc: '造成伤害后恢复自己的体力',
				construction: [2, 4, 6, 8, 10, 12, 16, 18, 20,],
			},{
				id: 17,name: '隐匿',trend:1,good:1,
				desc: '回合结束时自动降低存在感',
				construction: [1000, 1250, 1500, 1750, 2000, 2250, 2500, 2750, 3000,],
			},{
				id: 18,name: '战气',trend:2,good:1,
				desc: '造成伤害的同时削弱体力',
				construction: [2, 4, 6, 8, 10, 12, 14, 16, 18,],
			},{
				id: 19,name: '霸气',trend:2,good:1,
				desc: '造成伤害的同时削弱潜能',
				construction: [100, 125, 150, 175, 200, 225, 250, 275, 300,],
			},{
				id: 20,name: '威慑',trend:2,good:1,
				desc: '造成伤害的同时造成心理伤害',
				construction: [10, 20, 30, 40, 50, 60, 70, 80, 90,],
			},{
				id: 21,name: '专注',trend:1,good:1,
				desc: '受到的心理伤害减少',
				construction: [.8, .75, .7, .65, .6, .55, .5, .45, .4,],
			},{
				id: 22,name: '疗愈',trend:1,good:1,
				desc: '回合结束时自动恢复生命',
				construction: [.02, .025, .03, .035, .04, .045, .05, .055, .06,],
			},],
		badBuffs : [{ // 倾向分值[保护,强化,伤害,弱化]
				id: 101,name: '易伤',trend:3,good:0,
				desc: '受到的伤害增加',
				construction: [1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2, 2.1, 2.2,],
			},{
				id: 102,name: '出血',trend:3,good:0,
				desc: '进行攻击时会损失生命',
				construction: [.03, .035, .04, .045, .05, .055, .06, .065, .07],
			},{
				id: 103,name: '诅咒',trend:3,good:0,
				desc: '阻挡同级和低级的正面状态',
				construction: [0, 0, 0, 0, 0, 0, 0, 0, 0,],
			},{
				id: 104,name: '剧痛',trend:3,good:0,
				desc: '受到的治疗效果减弱',
				construction: [.7, .65, .6, .55, .5, .45, .4, .35, .3,],
			},{
				id: 105,name: '紊乱',trend:4,good:0,
				desc: '增加攻击和技能的体力消耗',
				construction: [1.2, 1.25, 1.3, 1.35, 1.4, 1.45, 1.5, 1.55, 1.6,],
			},{
				id: 106,name: '涣散',trend:4,good:0,
				desc: '潜能累积速度下降',
				construction: [.8, .75, .7, .65, .6, .55, .5, .45, .4,],
			},{
				id: 107,name: '暴露',trend:3,good:0,
				desc: '躲避和技能无法让存在感下降',
				construction: [0, 0, 0, 0, 0, 0, 0, 0, 0,],
			},{
				id: 108,name: '悬赏',trend:3,good:0,
				desc: '受到伤害会损失金币',
				construction: [.5, .6, .7, .8, .9, 1, 1.1, 1.2, 1.3,],
			},{
				id: 109,name: '失衡',trend:3,good:0,
				desc: '防御力恢复率下降，且无法自然恢复防御力',
				construction: [.6, .55, .5, .45, .4, .35, .3, .25, .2,],
			},{
				id: 110,name: '缺氧',trend:4,good:0,
				desc: '体力的恢复减少',
				construction: [.6, .55, .5, .45, .4, .35, .3, .25, .2,],
			},{
				id: 111,name: '乏力',trend:4,good:0,
				desc: '力量补正减少',
				construction: [.8, .74, .68, .62, .56, .5, .44, .38, .32,],
			},{
				id: 112,name: '模糊',trend:4,good:0,
				desc: '精准补正减少',
				construction: [.8, .74, .68, .62, .56, .5, .44, .38, .32,],
			},{
				id: 113,name: '迟钝',trend:4,good:0,
				desc: '行动力增速下降',
				construction: [.8, .76, .72, .68, .64, .6, .56, .52, .48,],
			},{
				id: 114,name: '鲁莽',trend:3,good:0,
				desc: '进行攻击时会损失防御力',
				construction: [.4, .44, .48, .52, .56, .6, .64, .68, .72,],
			},{
				id: 115,name: '破气',trend:4,good:0,
				desc: '进行攻击时会损失潜能',
				construction: [200, 250, 300, 350, 400, 450, 500, 550, 600,],
			},{
				id: 116,name: '恐惧',trend:3,good:0,
				desc: '回合结束损失心理防御',
				construction: [10, 20, 30, 40, 50, 60, 70, 80, 90,],
			},{
				id: 117,name: '促息',trend:4,good:0,
				desc: '受到伤害会损失体力',
				construction: [4, 8, 12, 16, 20, 24, 28, 32, 36,],
			},{
				id: 118,name: '麻痹',trend:4,good:0,
				desc: '受到伤害会损失潜能',
				construction: [100, 125, 150, 175, 200, 225, 250, 275, 300,],
			},{
				id: 119,name: '干毒',trend:4,good:0,
				desc: '回合结束损失生命值（固定值）',
				construction: [5, 10, 20, 30, 50, 80, 120, 180, 300,],
			},{
				id: 120,name: '迷惑',trend:3,good:0,
				desc: '受到话术和技能的心理伤害增加',
				construction: [1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2, 2.1, 2.2,],
			},{
				id: 121,name: '失智',trend:4,good:0,
				desc: '智力补正减少',
				construction: [.8, .75, .7, .65, .6, .55, .5, .45, .4,],
			},{
				id: 122,name: '湿毒',trend:3,good:0,
				desc: '回合结束损失生命值（百分比）',
				construction: [.04, .048, .056, .064, .072, .08, .088, .096, .104,],
			},],

		hpRangeMap: [ // 等级和血量范围表
			[2,5], // 1
			[4,8], // 2
			[10,20], // 3
			[15,40], // 4
			[20,65], // 5
			[37,95], // 6
			[75,175], // 7
			[150,250], // 8
			[250,400], // 9
			[400,650], // 10
			[650,950], // 11
			[950,1750], // 12
			[1750,2500], // 13
			[2500,4000], // 14
			[4000,6500], // 15
			[6500,9500], // 16
			[9500,17500], // 17
			[17500,25000], // 18
		],
		engRangeMap: [ // 等级和精力范围表
			[5,15], // 1
			[8,20], // 2
			[10,30], // 3
			[20,50], // 4
			[30,75], // 5
			[40,100], // 6
			[60,150], // 7
			[80,220], // 8
			[100,320], // 9
			[125,440], // 10
			[150,600], // 11
			[200,800], // 12
			[300,1000], // 13
			[400,1200], // 14
			[500,1400], // 15
			[600,1600], // 16
			[700,1800], // 17
			[800,2000], // 18
		],
		defRangeMap: [ // 等级和防御力范围表
			[1,2], // 1
			[1,3], // 2
			[1,4], // 3
			[1,5], // 4
			[2,10], // 5
			[3,20], // 6
			[5,40], // 7
			[8,60], // 8
			[12,100], // 9
			[18,160], // 10
			[25,250], // 11
			[35,400], // 12
			[50,600], // 13
			[75,900], // 14
			[110,1350], // 15
			[160,1800], // 16
			[300,2400], // 17
			[450,3200], // 18
		],
		attrRangeMap: [ // 等级和属性值范围表
			[2,12], // 1
			[3,15], // 2
			[4,20], // 3
			[5,25], // 4
			[7,40], // 5
			[9,60], // 6
			[12,85], // 7
			[15,120], // 8
			[18,150], // 9
			[22,180], // 10
			[26,220], // 11
			[30,260], // 12
			[35,300], // 13
			[40,350], // 14
			[45,410], // 15
			[50,475], // 16
			[55,555], // 17
			[60,656], // 18
		],
		weaponAtkRangeMap: [ // 武器等级和攻击力范围表
			[1,10], // 1
			[2,15], // 2
			[3,20], // 3
			[4,25], // 4
			[5,30], // 5
			[6,40], // 6
			[8,50], // 7
			[10,60], // 8
			[12,85], // 9
			[15,100], // 10
			[20,120], // 11
			[25,150], // 12
			[30,180], // 13
			[35,210], // 14
			[40,250], // 15
			[45,300], // 16
			[50,350], // 17
			[55,400], // 18
		],
		skillAtkRangeMap: [ // 技能等级和攻击力范围表
			[25,50], // 1
			[30,80], // 2
			[35,120], // 3
			[40,180], // 4
			[45,240], // 5
			[55,280], // 6
			[60,330], // 7
			[65,370], // 8
			[70,430], // 9
		],
		rxRangeMap: [ // 等级和属性补正范围表
			[2,25], // 1
			[3,30], // 2
			[4,35], // 3
			[5,40], // 4
			[6,50], // 5
			[8,65], // 6
			[10,80], // 7
			[12,100], // 8
			[15,120], // 9
			[18,140], // 10
			[22,160], // 11
			[26,180], // 12
			[30,200], // 13
			[35,220], // 14
			[40,240], // 15
			[45,260], // 16
			[50,280], // 17
			[55,300], // 18
		],

		spAttackList: [`压制`,`破盾`,`气溃`,`漩流`,`锁敌`,`攻心`,`偷窃`,],
		spAttackShrinkList: [`压`,`破`,`气`,`漩`,`锁`,`心`,`偷`,],
		spAttackDescList: [
			`25%概率让敌人行动进度回退`,
			`25%概率造成额外的穿甲伤害`,
			`25%概率削减敌人潜能`,
			`25%概率削减敌人体力`,
			`25%概率提升敌人存在感，不论是否命中`,
			`25%概率对敌人造成心理伤害`,
			`25%概率掠夺金币`,
		],
		spLevelMap: [ // sp威力等级表 TODO
			[5000,5500,6000,6500,7000,7500,8000,8500,9000,], // 0压制
			[.300,.350,.400,.450,.500,.550,.600,.650,.700,], // 1破盾
			[1000,1250,1500,1750,2000,2250,2500,2750,3000,], // 2气溃
			[  20,  30,  40,  50,  60,  70,  80,  90, 100,], // 3漩流
			[1000,1500,2000,2500,3000,3500,4000,4500,5000,], // 4锁敌
			[1000,1500,2000,2500,3000,3500,4000,4500,5000,], // 5攻心
			[1000,2000,3000,4000,5000,6000,7000,8000,9000,], // 6摸金
		],

		dodgeDeno: 1000, // 存在感计算分母
		ptcDeno: 1000, // 潜能计算分母
		intDeno: 1000, // 智力计算分母

		persuadeDodgeup: 2500, // 攻心提升自己存在感固定值

		leakDmgRatio: 2, // 破绽状态增伤倍数

		defAutoRecoverFactor: .5, // 防御值自动回升系数
		baseConsumeList: [1,3,1,0,1,1,2,5,], // 基础操作的体力消耗 0防御 1躲避 2追踪 3调息 4集气 5爆气 6劝降 7撤离
		spAttackRate: 25, // 武器的 SP 效果触发概率
		enviorDamageInterval: 30, // 战意流失触发频率（回合数）
		enviorDamageBase: 100, // 战意流失基础伤害

		dodgeupByTrace: 1000, // 追踪带来的存在感提升值
		fleeTotalMoveFactor: 20, // 撤离需要的总撤离值倍数

		aiExpireTime: 1000, // ai思考时间

		followChangesDelay: .35, // 跟随 changes 的结算延时（秒）

		shopRefreshInterval: 5, // 酒保商品更新频率（天）
		sellingRatio: .25, // 售卖价格比率
		skillXLevelMap: [5000,10000,20000,30000,45000,90000,], // 技能经验升级阈值分布（6级之前）
		skillXLevelRate: 1.5, // 技能经验升级阈值上涨比率（6级之后）

		// 全部地图数据
		mapConfigs: [
			{
				id:101, level:1, type:1, name:'龙虾村', links: [], size:1,
				floors:[], bosses:[],
			},
			{
				id:102, level:1, type:2, name:'活死人墓穴', links: [], size:4,
				floors:[
					{title:`流民`,thresGuard:0,guard:5,},
					{title:`盗墓贼`,thresGuard:30,guard:10,},
				],
				bosses:[{
					title: `祭品盗贼`, id: 51, inten: 4, expired: 15, gold: 5000,
				}],
			},
			{
				id:103, level:1, type:2, name:'非法山林', links: [102,], size:5,
				floors:[
					{title:`混混`,thresGuard:0,guard:1,},
					{title:`悍匪`,thresGuard:25,guard:2,},
					{title:`头目`,thresGuard:50,guard:3,},
				],
				bosses:[{
					title: `渡鸦`, id: 52, inten: 5, expired: 20, gold: 15000,
				}],
			},
			{
				id:104, level:2, type:2, name:'熔铁洞窟', links: [103,], size:5,
				floors:[
					{title:`学徒`,thresGuard:0,guard:1,},
					{title:`匠人`,thresGuard:20,guard:2,},
					{title:`铸剑师`,thresGuard:40,guard:4,},
				],
				bosses:[
					{ title: `舞女剑`, id: 53, inten: 4, expired: 25, gold: 20000, },
					{ title: `练星刀`, id: 54, inten: 4, expired: 25, gold: 20000, },
				],
			},
			{
				id:105, level:3, type:2, name:'雪海', links: [103,], size:5,
				floors:[
					{title:`水手`,thresGuard:0,guard:1,},
					{title:`海盗`,thresGuard:15,guard:2,},
					{title:`船长`,thresGuard:30,guard:4,},
				],
				bosses:[{
					title: `寒冰魅影`, id: 55, inten: 5, expired: 30, gold: 50000,
				}],
			},
			{
				id:106, level:4, type:2, name:'落叶城', links: [105,], size:6,
				floors:[
					{title:`佣兵`,thresGuard:0,guard:1,},
					{title:`佩剑士`,thresGuard:15,guard:2,},
					{title:`副将`,thresGuard:30,guard:4,},
					{title:`大将`,thresGuard:45,guard:8,},
				],
				bosses:[{
					title: `镇压官`, id: 56, inten: 5, expired: 35, gold: 80000,
				}],
			},
			{
				id:107, level:5, type:2, name:'愚困密道', links: [106,], size:6,
				floors:[
					{title:`密探`,thresGuard:0,guard:1,},
					{title:`信徒`,thresGuard:15,guard:2,},
					{title:`邪师`,thresGuard:30,guard:4,},
					{title:`主教`,thresGuard:45,guard:8,},
				],
				bosses:[
					{ title: `处刑人`, id: 57, inten: 5, expired: 40, gold: 100000, },
					{ title: `替罪者`, id: 58, inten: 5, expired: 40, gold: 100000, },
				],
			},
			{
				id:108, level:6, type:2, name:'云观', links: [106,], size:5,
				floors:[
					{title:`道士`,thresGuard:0,guard:1,},
					{title:`散仙`,thresGuard:15,guard:3,},
					{title:`破道者`,thresGuard:30,guard:8,},
				],
				bosses:[{
					title: `天体轨道护卫`, id: 59, inten: 6, expired: 45, gold: 250000,
				}],
			},
			{
				id:109, level:7, type:2, name:'终神宫', links: [107,108,], size:7,
				floors:[
					{title:`士族`,thresGuard:0,guard:1,},
					{title:`亲卫兵`,thresGuard:15,guard:2,},
					{title:`亲卫骑士`,thresGuard:30,guard:4,},
					{title:`副统帅`,thresGuard:45,guard:8,},
					{title:`统帅`,thresGuard:60,guard:15,},
				],
				bosses:[
					{ title: `恐惧之神`, id: 60, inten: 5, expired: 50, gold: 300000, },
					{ title: `痛苦之源`, id: 61, inten: 5, expired: 50, gold: 300000, },
					{ title: `谎言之主`, id: 62, inten: 5, expired: 50, gold: 300000, },
				],
			},
			{
				id:110, level:8, type:2, name:'漩涡', links: [109,], size:4,
				floors:[
					{title:`天选`,thresGuard:0,guard:5,},
					{title:`神话`,thresGuard:30,guard:10,},
				],
				bosses:[{
					title: `系统权限`, id: 63, inten: 6, expired: 60, gold: 1,
				}],
			},
		],
		initGuard: 10,

		// 商人聊天
		bartenderChats: [
			`我知道你早就看出来了，我和你一样是来自现实世界的穿越者，不过14年前我就已经决定在这里定居了。你不想留下来吗？`,
			`你可以在我这儿休息和采购，我会定期进货一些物美价廉的装备，希望对你有帮助。`,
			`他已经躲进了这个世界，为什么你还要追杀他？`,
			`除了你我，这个世界还有很多穿越者。这个酒馆里就有。`,
			`保持低调，赏金猎人。`,
			`这个世界的赏金并不能带回现实世界，如果你最终打算回去，那么在这个世界挣钱是毫无意义的，不是吗？`,
			`这个世界是生活，那个世界是生存。`,
			`不知道你有没有注意到，这个世界没有老人，即便他们年龄已经很大了。`,
			`为什么叫‘以太酒馆’？因为这里是以太世界。`,
			`这里一切都是虚拟的，唯有酒精是真实的。`,
			`欢迎回来，赏金猎人。`,
		],

 		// 胡言乱语
		balderdashs: ["你的大脑现在像一碗过期果冻，连勺子都捞不起一丝清醒。","你就像一块被太阳晒化的黄油，连煎锅都懒得理你。","你马上就要睡着了，比一只在高速公路上打太极的乌龟还慢。","听我的声音，你的眼皮重得像装满了诺贝尔后悔奖的箱子。","你正在进入梦乡，那里有会跳踢踏舞的冰箱和唱歌的卷心菜。","你的意志力比湿纸巾还软，一撕就破。","想象你是一颗被遗忘在沙发底下的爆米花，又硬又没用。","你开始感到困倦，就像期末考试前翻了三页书就倒下的学霸。","你就会变成一只只会发“咕噜咕噜”表情包的沙发土豆。","你的意识正在飘走，比WiFi信号穿过十堵墙还虚。","你的脚趾已经比政客的承诺还不靠谱了。","你越努力保持清醒，就越像一只试图用翅膀拧螺丝的企鹅。","你的大脑正在播放一部只有雪花屏的电影，主演是你自己。","你的思维已经开始打结了，比耳机线还乱。","你即将睡着，连闹钟都会替你尴尬地打呼噜。","它们硬得像个被拒绝加薪的机器人。","你的潜意识正在开门，但门把手是个只会说“密码错误”的冷笑话。","你快要沉入梦海，救生圈是一只漏气的橡皮鸭。","从现在起，每数一个数，你就傻一倍。一……你已经在傻笑了。","你像一块被微波炉叮了三分钟的冻芝士，外面糊了里面还是冰的。","闭上眼睛你会看到一群跳摇滚的胡萝卜，领舞的是你前任。","你的理智正在打包行李，目的地是“随便你怎样”岛。","你的紧张感比被猫盯上的金鱼还多余。","现在你觉得自己是一只行走的冷笑话数据库。","数羊？别费劲了，你的羊都在开派对，还邀请了你家路由器。","你的身体正在融化，像蜡烛一样，但蜡油是废话做的。","梦里你会因为不会拧瓶盖而被授予“年度最废柴奖”。","你的眼皮在跳街舞，可惜评委是凌晨三点的闹钟。","你的思维已经卡在了“加载中……”界面，进度条永远99%。","你的智商暂时借给了隔壁的猫，它正在用它开罐头。","你正在进入深度放松，连打喷嚏都会变成慢动作回放。","你的注意力比泡沫还轻，一戳就炸，炸出来的是废话。","你的记忆正在玩捉迷藏，但所有人都忘了数到十。","连你的影子都已经打呼了。","你的挣扎看起来像一条试图给鱼做心肺复苏的毛巾。","你的大脑刚刚蓝屏了，错误代码：0x00FFEEEE（太困了不想修）。","你正在坠入梦乡，降落伞是一句“明天再说”。","你现在是世界上最无聊的人，连无聊都觉得你无聊。","你的眼皮上好像站着一只跳踢踏舞的河马，每一下都很沉重。","从此你的口头禅变成“嗯……你说得对，但我忘了”。","你的逻辑已经离家出走了，还带走了你的闹钟电池。","梦里你会因为数不清手指而被幼儿园开除。","你的意识正在下线，比一款没人玩的游戏还冷清。","你的呼吸比树懒批改作业还慢。","你正在变成一床被子，但只能盖住自己的尴尬。","你的紧张感像一只试图用吸管喝干大海的蚊子。","你的思维已经变成了一锅浆糊，连勺子都站不稳。","你的梦境导演是个只会拍广告的实习生。","你会觉得自己是一颗被嚼了三遍的口香糖，毫无价值。","你的注意力被一只路过的蟑螂借走了，它用来做体操。","你的意志力比湿沙子堆的城堡还脆弱。","你的眼皮重得像是被贴满了“我原谅你了”的便利贴。","你越听越想笑，一笑就想打嗝，打嗝就会醒，但你就是醒不过来。","现在你觉得自己是一个会走路的人形冷笑话发射器。","你的身体已经软得像一块忘了放冰箱的布丁。","连你的手机都会自动调成飞行模式因为你太无聊。","你的大脑正在播放一部只有你自己主演的灾难片，片名《我为什么还不睡》。","想象你是一棵西兰花，正在被一只失眠的兔子嘲笑。","你的意识已经飘到了天花板上，正在和电灯泡吵架。","你的思考速度比蜗牛发微信还慢。","梦里你会因为不会翻白眼而被开除滑稽学院。","你的注意力被一只蚊子截胡了，它用它来点外卖。","从此你觉得“随便”是世界上最好吃的食物。","你的挣扎看起来像一条试图骑自行鱼的鱼。","你的眼皮在跳华尔兹，但舞伴是一块砖头。","你的梦境现在正在加载贴片广告，时长三小时。","你的思维已经变成了一台只会打印“哈哈”的坏打印机。","你的理智已经辞职了，新来的CEO是一只仓鼠。","你正在进入深度睡眠，连你的尴尬癌都治愈了。","你会觉得自己是一根被舔过又放回去的棒棒糖。","你的注意力比金鱼还短，金鱼至少能记住你欠它钱。","现在你每次想笑都会打嗝，每次打嗝都会放屁。","你的身体已经轻得像一句“对不起，我忘了”。","梦里你会因为不会系鞋带而被袜子嘲笑。","你的大脑正在格式化，进度条卡在69%，因为电脑也笑了。","你的呼吸比老年人用2G网刷视频还卡。","你的潜意识现在是个只会复读“然后呢”的复读机。","你的意志力已经用完了，就像最后一滴洗发水，怎么挤都是空气。","你的紧张感像一只试图给老虎修指甲的兔子。","从此你觉得“不知道”是最标准的答案。","你的眼皮上好像站着一只开演唱会的蜗牛，安可曲是《慢动作催眠》。","你正在进入梦乡，门口写着“闲人免进，蠢人自便”。","你的思维已经变成了一碗只会说“啊？”的燕麦粥。","你的智商暂时降到了室温，而且还是冬天的室温。","梦里你会因为不会眨眼睛而被电风扇开除。","你的注意力被你自己弄丢了，它现在正在和垃圾桶谈恋爱。","现在你觉得打呼噜是最高级的音乐。","你的身体已经软得像一句“我没事，真的”。","你的梦境编剧是只喝醉了的鸽子。","你的大脑现在是一台只会播放“哔——”的消音器。","你的呼吸比冰块融化还慢，还滴答滴答的。","你正在进入催眠状态，你的潜意识里有一只鹦鹉在背圆周率。","你的眼皮重得像刚看完所有《指环王》导演剪辑版还没上厕所。","你的挣扎看起来像一只试图用吸管举重的蚂蚁。","从此你觉得“等一下”是最精确的时间单位。","你的注意力被一只路过的塑料袋劫持了，它用它当风筝。","梦里你会因为不会伸舌头而被狗嘲笑。","你的思维已经变成了一锅只会冒泡的废话汤。","你的理智已经去度假了，明信片写着“别找我”。","连你的影子都开始打呼噜了，还磨牙。","你的眼睛里有星星，而我只想当那颗最亮的，闪瞎你。","怕你突然就不理我了，又怕你对我太好，我会变贪心。","你的名字，是我见过最短的情诗。","我不会说情话，但我愿意学着说，只对你说。","你闻到什么味道了吗？为什么你一出现，空气就变甜了。","你是我的今天，以及所有的明天。","我最近有点忙，忙着喜欢你，忙着想你，忙着找理由跟你说话。","你的手有点冷，让我帮你暖暖，顺便牵一下。","你知道你和星星的区别吗？星星在天上，你在我心里。","我对你的喜欢，就像肚子饿了想吃东西一样，自然又忍不住。","你是不是偷了我的东西？不然为什么我一看见你，心就不见了。","你的笑容，像一块软糖，甜得让我想收藏起来慢慢化。","我想变成你每天起床的第一个念头，和睡前的最后一个画面。","你猜我是什么星座？我是为你量身定做。","你的名字，写在我的草稿纸上，也写在我的心上。","我好像得了一种病，只有你能治的病，叫“见不到你会疯”。","你是我枯燥生活里，唯一的一颗跳跳糖。","你的眼睛像一片海，我想沉在里面，再也不上来。","我最近学会了一样本领，就是闭上眼就能看到你。","你不需要很完美，你只需要站在那里，我就想靠近。","我的手空着，你的手要不要也空一下？","你对我笑一下，我今天的阴天就放晴了。","你是不是充电宝？我一靠近你，浑身就有电。","我想和你一起做很多无聊的事，比如看云，比如发呆，比如数你睫毛。","你的声音像棉花糖，又软又轻，听得我心痒痒。","我没什么特长，就是喜欢你的时间特别长。","你是我遇见的所有美好里，最刚好出现的那一个。","我的世界原本是灰色的，你来了，就变成了棉花糖色。","你走路的时候，风都变温柔了，因为它在帮你开路。","我想把所有的温柔都攒起来，一次性全部送给你。","你的存在，对我来说，就是一个持续的、舒服的深呼吸。","我有点想你了，虽然你就在我旁边，但还是想。","你像一杯温热的牛奶，让我在失眠的夜里感到安心。","我的心思很好猜，除了你，就是关于你。","你是我平淡生活里，最想掀起的那点波澜。","你的头发丝都在发光，照得我心里的小鹿乱撞。","我最近变得很胆小，怕你说“嗯”，怕你说“哦”，更怕你不理我。","你像一朵软乎乎的云，我想躺上去。","我的每一个明天，都想预约你的早安。","你对我笑的时候，我连以后孩子叫什么都想好了。","你的手心里有太阳吗？为什么我握着的时候这么暖。","我好像一个没出息的小偷，专门偷看你。","你是我所有的心动和例外。","我的喜欢很便宜，每天都说，但又很贵，只给你。","你就像一颗糖，放在我的口袋里，让我随时都觉得甜。","我最近总是不自觉地笑，都是因为你。","你的眼睛里有光，我想那是我的倒影。","我想和你一起浪费时间，比如从日出看到日落，一句话也不说。","你是我遇见的最大的幸运，没有之一。","你的声音像耳机里放出来的温柔男声，让我想单曲循环。","我好像被你下了蛊，满脑子都是你。","你是我所有诗和远方的终点。","你的手指很好看，不知道牵起来是什么感觉。","我最近学会了读心术，你猜我现在读到了什么？你的名字。","你像冬天的暖水袋，没有你，我睡不着。","我的世界很小，只能装下你一个人，连转身都困难。","你对我点点头，我就觉得全世界都亮了。","我想变成你衣服上的第二颗纽扣，离你心脏最近的地方。","你的温柔像一场细雨，不知不觉就把我淋湿了。","我没什么大志向，就是想每天都能看到你。","你是我所有无聊时间里，最有趣的消遣。","你的背影都很好看，让我想追上去，然后说“好巧”。","我好像得了一种“不跟你说晚安就睡不着”的病。","你像一首单曲循环的歌，怎么听都不会腻。","我的眼睛很小，只能装下你一个。","你是我所有犹豫里的毫不犹豫。","你的存在，让我觉得这个世界好像也没那么糟糕。","我想和你一起躲雨，这样就能离你近一点。","你是我所有胡思乱想的起点和终点。","你的呼吸声，对我来说就是最好的白噪音。","我好像一只风筝，线在你手里，你拉一下我就回来。","你是我所有不冷静里的唯一冷静。","你的侧脸很好看，我想把它画下来，但我画不出那种心动。","我最近变得很爱看天气预报，因为想知道你那边冷不冷。","你像一杯刚好37度的水，不烫嘴，很舒服。","我的所有密码里都有你的生日，因为我想记住你。","你是我所有无聊笑话里的唯一真心。","你的沉默都让我觉得安心，因为我知道你在。","我想变成你起床时的闹钟，只叫醒你，不吵你。","你是我所有逃避里的唯一勇敢。","你的每一个小动作，我都想收藏起来，慢慢看。","我好像有点依赖你了，像植物依赖阳光。","你是我所有杂乱思绪里的唯一一条直线。","你的名字，是我写过最漂亮的字。","我想和你一起养一只猫，或者什么都不养，就养我们。","你是我所有遗憾里的唯一圆满。","你的呼吸节奏，我想跟着一起，慢慢变老。","我最近变得很爱照镜子，因为想看看你喜欢的我长什么样。","你像一把钥匙，打开了所有我关于美好的想象。","我的所有愿望里，都有一个你。","你是我所有悲伤里的唯一解药。","你的肩膀看起来很适合靠，不知道能不能试用一下。","我想变成你的影子，这样你去哪我就去哪。","你是我所有黑暗里的唯一一盏灯。","你的存在，让我觉得等待也是一件好事。","我好像被你按下了暂停键，时间停在你对我笑的那一刻。","你是我所有答案里的唯一正确答案。","你的温柔让我觉得自己像一块被好好放着的奶油蛋糕。","我想和你一起刷牙，一起看镜子里的我们。","你是我所有开始里的唯一不后悔。","你的声音，是我听过最温柔的药。","我好像有点等不及了，等不及和你一起变老。",],

    },
	PRESETS: { // 预设角色
		unitList: [{ // 商人酒保
			id: 1,
			level: 15,
			age: 37,
			nk: '商人酒保',
			as: [43150,8535,1280,250, 650,1795,1600,1900,1890,242,715,], // 11维身体属性（4个外在，7个内在） [0血量,1精力,2体力,3防御, 4力量,5精准,6速度,7智力,8定力,9隐蔽,10爆发]
			st: [43150,8535,],
			tms: 0,
			rel: 1,
			rt: 100001,
			ss: [], // 技能ID数组
			es: [0,0,0,0,0,0,0,], // 装备ID数组 [0手一，1手二，2配饰一，3配饰二，4身体，5头，6脚]
			b: [], // 背包，存放装备ID
		}],
		skillList:[],
		equipList:[],
	},
}
/*
∷⊕▓▣▦░↔†✉◘◙
game = {
	day: 1,
	mapList: [], // 所有地图数据数字
	wantedList: [], // 悬赏榜
	x: 370, // 主角技能经验
	xl: 1, // 主角技能经验等级
	xp: 2, // 主角技能复制点数

	allUnits: [], // 角色
	unitIndex: 101, // 角色 ID 索引
	allEquips: [], // 装备
	equipIndex: 101, // 装备 ID 索引
	allSkills: [], // 技能
	skillIndex: 101, // 技能 ID 索引
}

map = {
	id: 102,
	flagIndexes: [4,7,9,15,], // 所有标旗所在index
	flagMarks: [0,0,1,0,], // 所有标旗的标记状态 [0未标记 1已标记]
	coreIndex: 6, // 核心所在index
	coreMark: 1, // 核心的标记状态
	coreDefeat: false, // 核心是否已被打败
}

wanted = {
	id: 51, // 目标单位的id
	e: 5, // 截至日期（天）
	t: `柳唐`, // 目标单位名字
	n: `祭品盗贼`, // 目标单位昵称
	s: 0, // 状态 0未公示 1悬赏中 2逾期 3已领取 4已完成
	g: 5000, // 奖励金额
}

skill = {
	id: 101,
	l: 7, // 等级(1-9)
	n: '治愈术',
	t: 1, // 1自己 2我方单体 3敌方单体
	el: [{ // 技能效果数组
        t: 3, // 效果类型【 1攻击 2添加状态 3减弱一个增益状态 4削减一个减益状态 5恢复生命 6改变护甲 7改变潜能 8改变心防 9改变存在感】
		// 攻击方式{...attack}，添加的状态-等级数组{ b:[1,2], bl:[3,4],}，
		// 固疗和百分疗 { h:100, rx:35, }，心防固定修改值和定力、智力补正 { d:100, rx1:0, rx2:44, }
		// 潜能补正 { d:100, rx:35, }，存在感 { d:100, rx:35, }
		// 减弱状态强度 7
		d: 7,
    },],
	c: 6, // 体力消耗
	d: 1200, // 存在感
	v: 133, // 价值
	o: 4, // 顺位
}

equip = {
	id: 102,
	n: '龙虾刀', // 名字
	l: 7, // 等级(1-15)
	it: 0, // 强度(0-4)
	t: 1, // 类型 [1手,2头,3身体,4配饰,5脚]
	a: [[0,113],[2,16],[4,78],], // 属性加成 [[属性下标,属性调整值]]
	d: 4725, // 存在感
	k: [ // 攻击方式
		{
			n: '挥砍',
			d: 99, // 基础伤害
			r1: 15, // 力量补正
			r2: 7, // 精准补正
			b: [103,105,], // buff制造表（buff id）
			bl: [4,3], // buff等级表（1-9）
			s: 4, // SP效果 1压制 2破盾 3气溃 4漩流 5锁敌 6攻心 7摸金
			sl: 2, // SP效果等级
			a: 0, // 目标是否为全体
			c: 4, // 体力消耗
			et: 1, // 特效类型 1劈砍 2钝击 3子弹 4飞刀 5火炮 6雷击
			sid: 1, // 所属的技能id
			eid: 1, // 所属的武器id
		},
	],
	v: 225, // 价值
}

unit = {
	id: 106, //
	l: 7, // 等级(1-15)
	it: 2, // 强度(0-4)

	nm: '赵日天', // 名字
	nk: '地狱刑警', // 称号
	gd: 1, // 性别 1男0女
	age: 18, // 年龄
	sty: [15,28,77,4,14,], // 性格 [勇猛,敏感,野心,理智,道德]
	tms: 1, // 主角队伍中的顺位，由小到大【0：不在主角队伍中】
	rel: 1, // 关系 0敌对 1相识 2同道 3在队
	g: 18470,
	i: '1', // 头像型号 1-3

	rt: 100034, // registerTime注册时间：十万位数=天，其他位数=秒

	as: [50,35,2,0, 20,14,16,17,14,25,13,], // 11维身体属性（4个外在，7个内在） [0血量,1精力,2体力,3防御, 4力量,5精准,6速度,7智力,8定力,9隐蔽,10爆发]

	ba: [1000,500,], // Boss附加属性 [0血量,1精力,]
	st: [50,35,], // 当前状态 [0血量,1精力,]

	ss: [1,], // 技能ID数组

	es: [22,0,0,0,11,0,33,], // 装备ID数组 [0手一，1手二，2配饰一，3配饰二，4身体，5头，6脚]

	b: [], // 背包，存放装备ID

	btd: { // 战斗中的状态

		hp: [50,50,], // 生命力
		def: [2,2,], // 护甲
		eng: [35,35,], // 精力
		phy: [35,35,], // 体力
		dge: 5000, // 存在感
		mov: 0, // 行动值
		ptc: 0, // 潜能
		mdef: 150, // 心理防御
		money: 0, // 金币

		attrs: [50,35,2,0, 20,14,16,17,14,25,17,], // 4维面板+7维属性 [0血量,1精力,2体力,3防御, 4力量,5精准,6速度,7智力,8定力,9隐蔽,10爆发]
		oattrs: [50,35,2,0, 20,14,16,17,14,25,17,], // 固有11维身体数值

		weaponName1: '龙虾刀',
		weaponName2: '',
		weaponList: [{...equip数据}], // 武器，最多2个
		equipList: [{...equip数据},null,{...equip数据},{...equip数据},null,{...equip数据},{...equip数据},], // 身上的装备[0手一，1手二，2配饰一，3配饰二，4身体，5头，6脚]
		bagList: [{...equip数据}], // 包里的装备
		skillList: [{...skill数据}],

		defaultAttack: {
			n: '手刀',
			d: 10, // 基础伤害
			r1: 30, // 力量补正
			r2: 0, // 精准补正
			b: [], // buff制造表（buff id）
			bl: [], // buff等级表（1-9）
			s: 1, // SP效果 1压制 2破盾 3气溃 4漩流 5锁敌 6攻心 7摸金
			sl: 1, // SP效果等级
			a: 0, // 目标是否为全体
			c: 1, // 体力消耗
			et: 2, // 特效类型 1劈砍 2钝击 3子弹 4飞刀 5火炮 6雷击
			sid: 0, // 所属的技能id
			eid: 0, // 所属的武器id
		},

		buffList: [{ // 状态栏
			id: 1,
			name: '急救',
			desc: '每回合恢复生命力',
			level: 1,
			good: 1,
		},]

		out: 1, // 出局状态 0存活 1战退 2屈服
		isPlayer: 1, // 玩家可操控
		roundTotal: 1, // 每回合可以行动的次数
		score: 19000, // 战斗分数
		price: 374900, // 雇佣价格

		penetrated: 0, // 本回合已被破防
		changes:{
			hp: 0, // 生命力
			def: 0, // 防御力
			eng: 0, // 精力
			phy: 0, // 体力
			dge: 0, // 存在感
			mov: 0, // 行动值
			ptc: 0, // 潜能
			mdef: 0, // 心理防御
			money: 0, // 金币
			buffList: [{ id:11, level:3, },], // 新增buff数组
			removeBuff: { id: 1, level:3, }, // 要削减的buff
			capitulate: 0, // 本回合是否有被劝降过

			// 0无 1slash 2smash 3bullet 4range 5fire 6thunder 7cure 8power 9pure 10mental 11-16重攻击  50shield 51blood
			// 201浮动数字（血|精力|心防|钱） 102行动力 103潜能 104存在感 105破盾 106miss
			effectTypeList: [12,101,104],
			domAni: 'shake|cast',
		}
		followChanges:{ // 跟随changes,用于展示第二次动画
			hp: 0, // 生命力
			def: 0, // 防御力
			eng: 0, // 精力
			phy: 0, // 体力
			dge: 0, // 存在感
			mov: 0, // 行动值
			ptc: 0, // 潜能
			mdef: 0, // 心理防御
			money: 0, // 金币
			buffList: [], // 新增buff数组
			removeBuff: {}, // 要削减的buff
			capitulate: 0, // 本回合是否有被劝降过

			effectTypeList: [12,101,104],
			domAni: '',
		}
	},

	// 冗余数据
	tickCount: 11,
	overflowMove: 22,

}

*/
