module.exports = {
	DEBUG: 1,
	CACHE: {
		sto: '_DS_RWD_L',
	},
	CONFIG:{
		attrMap: [`生命`,`精力`,`体力`,`防御`,`力量`,`精准`,`速度`,`智力`,`定力`,`隐蔽`,`爆发`,],
		goodBuffs: [{ // 倾向分值[1保护,2强化,3伤害,4弱化]
				id: 1,name: '疗愈',trend:1,good:1,
				desc: '受到的治疗效果增强',
			},{
				id: 2,name: '护盾',trend:1,good:1,
				desc: '受到的伤害减少',
			},{
				id: 3,name: '祝福',trend:1,good:1,
				desc: '屏蔽等级更低的负面效果',
			},{
				id: 4,name: '屏息',trend:2,good:1,
				desc: '减少体力消耗',
			},{
				id: 5,name: '蓄能',trend:2,good:1,
				desc: '潜能累积速度更快',
			},{
				id: 6,name: '潜行',trend:1,good:1,
				desc: '存在感下降更多',
			},{
				id: 7,name: '淘金',trend:1,good:1,
				desc: '造成伤害后能获得金币',
			},{
				id: 8,name: '架势',trend:1,good:1,
				desc: '受到伤害后立刻恢复防御力',
			},{
				id: 9,name: '内息',trend:2,good:1,
				desc: '受到伤害后立刻恢复体力',
			},{
				id: 10,name: '狂暴',trend:2,good:1,
				desc: '受到伤害后立刻提升行动力',
			},{
				id: 11,name: '反伤',trend:1,good:1,
				desc: '对伤害来源造成伤害',
			},{
				id: 12,name: '嗜血',trend:1,good:1,
				desc: '造成伤害后恢复自己的生命',
			},{
				id: 13,name: '猛攻',trend:2,good:1,
				desc: '提升力量补正',
			},{
				id: 14,name: '鹰眼',trend:2,good:1,
				desc: '提升精准补正',
			},{
				id: 15,name: '迅捷',trend:2,good:1,
				desc: '提升行动力增速',
			},{
				id: 16,name: '凝神',trend:2,good:1,
				desc: '造成伤害后恢复自己的体力',
			},{
				id: 17,name: '隐匿',trend:1,good:1,
				desc: '减少存在感的提升',
			},{
				id: 18,name: '战气',trend:2,good:1,
				desc: '造成伤害的同时削弱精力',
			},{
				id: 19,name: '战魂',trend:2,good:1,
				desc: '造成伤害的同时削弱潜能',
			},{
				id: 20,name: '看透',trend:2,good:1,
				desc: '对敌人的心里防御造成更多伤害',
			},{
				id: 21,name: '专注',trend:1,good:1,
				desc: '受到的心里防御伤害减少',
			},],
		badBuffs : [{ // 倾向分值[保护,强化,伤害,弱化]
				id: 101,name: '易伤',trend:3,good:0,
				desc: '受到的伤害增加',
			},{
				id: 102,name: '出血',trend:3,good:0,
				desc: '进行攻击时会损失生命',
			},{
				id: 103,name: '感染',trend:3,good:0,
				desc: '受到的治疗效果减弱',
			},{
				id: 104,name: '诅咒',trend:3,good:0,
				desc: '屏蔽等级更低的正面效果',
			},{
				id: 105,name: '紊乱',trend:4,good:0,
				desc: '体力消耗更大',
			},{
				id: 106,name: '涣散',trend:4,good:0,
				desc: '潜能累积速度下降',
			},{
				id: 107,name: '锁定',trend:3,good:0,
				desc: '存在感降低能力减弱',
			},{
				id: 108,name: '悬赏',trend:3,good:0,
				desc: '受到伤害会损失金币',
			},{
				id: 109,name: '失衡',trend:3,good:0,
				desc: '防御力的恢复减少',
			},{
				id: 110,name: '缺氧',trend:4,good:0,
				desc: '体力的恢复减少',
			},{
				id: 111,name: '无力',trend:4,good:0,
				desc: '力量补正减少',
			},{
				id: 112,name: '模糊',trend:4,good:0,
				desc: '精准补正减少',
			},{
				id: 113,name: '迟钝',trend:4,good:0,
				desc: '行动力增速下降',
			},{
				id: 114,name: '破绽',trend:3,good:0,
				desc: '进行攻击时会损失防御力',
			},{
				id: 115,name: '破气',trend:4,good:0,
				desc: '进行攻击时会损失潜能',
			},{
				id: 116,name: '暴露',trend:3,good:0,
				desc: '增加存在感的提升',
			},{
				id: 117,name: '促息',trend:4,good:0,
				desc: '受到伤害会损失精力',
			},{
				id: 118,name: '麻痹',trend:4,good:0,
				desc: '受到伤害会损失潜能',
			},{
				id: 119,name: '剧痛',trend:4,good:0,
				desc: '进行攻击时会损失精力',
			},{
				id: 120,name: '失神',trend:3,good:0,
				desc: '受到的心理伤害增加',
			},{
				id: 121,name: '迷惑',trend:4,good:0,
				desc: '对敌人造成的心理伤害减弱',
			},],
		hpRangeMap: [ // 等级和血量范围表
			[30,80], // 1
			[40,150], // 2
			[55,280], // 3
			[150,500], // 4
			[300,950], // 5
			[500,1700], // 6
			[800,3200], // 7
			[1250,5500], // 8
			[2000,10000], // 9
		],
		engRangeMap: [ // 等级和精力范围表
			[40,100], // 1
			[60,150], // 2
			[80,220], // 3
			[100,320], // 4
			[125,440], // 5
			[150,600], // 6
			[200,800], // 7
			[300,1000], // 8
			[400,1200], // 9
		],
		defRangeMap: [ // 等级和防御力范围表
			[1,5], // 1
			[2,10], // 2
			[3,20], // 3
			[5,40], // 4
			[8,75], // 5
			[12,120], // 6
			[18,250], // 7
			[25,600], // 8
			[50,1500], // 9
		],
		attrRangeMap: [ // 等级和属性值范围表
			[5,25], // 1
			[8,50], // 2
			[12,80], // 3
			[16,120], // 4
			[22,180], // 5
			[30,260], // 6
			[38,360], // 7
			[46,480], // 8
			[56,656], // 9
		],
		weaponAtkRangeMap: [ // 武器等级和攻击力范围表
			[1,12], // 1
			[2,20], // 2
			[3,30], // 3
			[5,40], // 4
			[10,55], // 5
			[15,75], // 6
			[20,100], // 7
			[25,130], // 8
			[30,170], // 9
		],
		skillAtkRangeMap: [ // 技能等级和攻击力范围表
			[25,50], // 1
			[30,80], // 2
			[35,120], // 3
			[40,180], // 4
			[45,240], // 5
			[55,280], // 6
			[60,330], // 7
			[65,370], // 8
			[70,430], // 9
		],
		rxRangeMap: [ // 等级和属性补正范围表
			[1,4], // 1
			[1,6], // 2
			[1,9], // 3
			[2,12], // 4
			[2,15], // 5
			[3,18], // 6
			[3,22], // 7
			[4,26], // 8
			[5,30], // 9
		],
    }
}
/*

game = {
	money: 1000,
	day: 1,
	hour: 0,
	meTeamIDs: [1,2,4,9,], // 队伍角色ID
	currentMapID: 101, // 当前所在地图ID
	luck: 0, // 夺宝能力

	allUnits: [], // 角色
	unitIndex: 101, // 角色 ID 索引
	allEquips: [], // 装备
	equipIndex: 101, // 装备 ID 索引
	allSkills: [], // 技能
	skillIndex: 101, // 技能 ID 索引
	allMaps: [], // 地图
}

map = {
	id: 1,
	n: '', // 名字
	l: '', // 等级
	t: 2, // 类型 1城镇 2荒地 3地牢
	f: [], // 层数组
}

skill = {
	id: 11,
	l: 1,
	n: '治愈术',
	t: 1, // 1自己 2我方单体 3敌方单体
	el: [{ // 技能效果数组
        t: 3, // 效果类型【 1攻击 2添加状态 3减弱一个状态 4恢复生命 5改变护甲 6改变潜能 7改变心防 8改变存在感 】
        d: 7, // 攻击方式{d:5,r1:24,r2:17}，添加的状态-等级数组{ b:[1,2], bl:[3,4],}，固疗和百分疗 { h:100, rx:35},心防固伤和智力补正 { d:100, rx:35 }
    },],
	c: 6, // 体力消耗
	d: 1200, // 存在感
	v: 133, // 价值
}

equip = {
	id: 11,
	n: '龙虾刀', // 名字
	t: 1, // 类型 [1手,2头,3身体,4配饰,5脚]
	a: [[0,113],[2,16],[4,78],], // 属性加成 [[属性下标,属性调整值]]
	d: 4725, // 存在感
	k: [ // 攻击方式
		{
			n: '挥砍',
			d: 99, // 基础伤害
			r1: 15, // 力量补正
			r2: 7, // 精准补正
			b: [103,105,], // buff制造表（buff id）
			bl: [4,3], // buff等级表（1-9）
			s: 4, // 特殊效果 1硬直 2破甲 3削气 4必中 5削精 6攻心
			sl: 2, // 特殊效果等级
			a: 0, // 目标是否为全体
			c: 4, // 体力消耗
		}
	],
	v: 225, // 价值
}

role = {
	id: 1, //

	nm: '赵日天', // 名字
	nk: '地狱刑警', // 称号
	gd: 1, // 性别
	age: 18, // 年龄
	sty: [15,28,77,4,14,], // 性格 [勇猛,敏感,野心,理智,道德]
	tms: 1, // 主角队伍中的顺位，由小到大【0：不在主角队伍中】
	rel: 3700, // 好感度 0-10000

	as: [50,35,2,0, 20,14,16,17,14,25,], // 十维身体属性 [0血量,1精力,2体力,3防御, 4力量,5精准,6速度,7智力,8定力,9隐蔽,10爆发]

	st: [50,35,], // 当前状态 [0血量,1精力,]

	ss: [1,] // 技能ID数组

	es: [22,0,0,0,11,0,33,], // 装备ID数组 [0手一，1手二，2配饰一，3配饰二，4身体，5头，6脚]

	btd: { // 战斗中的状态
		weaponName1: '龙虾刀',
		weaponName2: '',
		weaponList: [{...equip数据}],
		hp: [50,50,], // 生命力
		def: [2,2,], // 护甲
		eng: [35,35,], // 精力
		phy: [35,35,], // 体力
		dge: 5000, // 存在感
		mov: 0, // 行动值
		ptc: 0, // 潜能

		attrs: [50,35,2,0, 20,14,16,17,14,25,], // 4维面板+7维属性 [0血量,1精力,2体力,3防御, 4力量,5精准,6速度,7智力,8定力,9隐蔽,10爆发]
		oattrs: [50,35,2,0, 20,14,16,17,14,25,], // 固有11维身体数值

		buffs: [{ // 状态栏
			id: 1,
			name: '急救',
			desc: '每回合恢复生命力',
			level: 1,

			trendVals: [20,0,0,0], // 倾向分值[保护,强化,伤害,弱化]
		},]

		mdef: 150, // 心理防御
		alive: 1, // 存活
		isPlayer: 1, // 玩家可操控
	},

	// 冗余数据
	tickCount: 11,
	overflowMove: 22,

}

*/

/*
effects: [{ // 额外效果列表
	trigType: 1, // 触发类型 【1:战斗开始|2:公共回合开始|3:自己回合开始|4:发动攻击|5:受到攻击|6:发动治疗|7:生命力提升】
	targets: [3,], // 作用目标ID列表
	eventType: 1, // 事件类型 【1：属性调整|2：金币调整|3：添加状态|4：消除状态】
	event:
},]
*/
